In [2]:
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt
import seaborn as sns

import scipy.stats as stats

import os

from pydataset import data

#1
In a jupyter notebook, classification_exercises.ipynb, use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

print the first 3 rows
print the number of rows and columns (shape)
print the column names
print the data type of each column
print the summary statistics for each of the numeric variables. Would you recommend rescaling the data based on these statistics?

In [6]:
#1
df_iris = data('iris')
df_iris.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

In [13]:
#1
df_iris.shape

(150, 5)

In [11]:
#1
df_iris.columns

# or create a list
# df_iris.tolist()

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

In [12]:
#1
df_iris.dtypes

Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

In [18]:
#1
stats = df_iris.describe().T
# .T transcribes the df so that we can call the columns that we want
stats

              count      mean       std  min  25%   50%  75%  max
Sepal.Length  150.0  5.843333  0.828066  4.3  5.1  5.80  6.4  7.9
Sepal.Width   150.0  3.057333  0.435866  2.0  2.8  3.00  3.3  4.4
Petal.Length  150.0  3.758000  1.765298  1.0  1.6  4.35  5.1  6.9
Petal.Width   150.0  1.199333  0.762238  0.1  0.3  1.30  1.8  2.5

In [20]:
#1
stats['range'] = stats['max'] - stats['min']
stats
# I don't think rescaling is necessary because the different rows and columns
# are in a similar range

              count      mean       std  min  25%   50%  75%  max  range
Sepal.Length  150.0  5.843333  0.828066  4.3  5.1  5.80  6.4  7.9    3.6
Sepal.Width   150.0  3.057333  0.435866  2.0  2.8  3.00  3.3  4.4    2.4
Petal.Length  150.0  3.758000  1.765298  1.0  1.6  4.35  5.1  6.9    5.9
Petal.Width   150.0  1.199333  0.762238  0.1  0.3  1.30  1.8  2.5    2.4

#2
Read the Table1_CustDetails table from the Excel_Exercises.xlsx file into a dataframe named df_excel.

assign the first 100 rows to a new dataframe, df_excel_sample
print the number of rows of your original dataframe
print the first 5 column names
print the column names that have a data type of object
compute the range for each of the numeric variables.

In [3]:
#2
df_telco = pd.read_excel('Spreadsheets_Exercises.xlsx')
df_telco.head()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn,Unnamed: 12,Unnamed: 13
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,65.6,593.30,No,NaN,NaN
1,0003-MKNFE,Male,0,No,No,2,1,0,Mailed check,59.9,542.40,No,NaN,NaN
2,0004-TLHLJ,Male,0,No,No,1,2,0,Electronic check,73.9,280.85,Yes,NaN,NaN
3,0011-IGKFF,Male,1,Yes,No,1,2,0,Electronic check,98.0,1237.85,Yes,NaN,NaN
4,0013-EXCHZ,Female,1,Yes,No,1,2,0,Mailed check,83.9,267.40,Yes,NaN,NaN

In [4]:
#2
# convert these columns to boolean
df_telco.partner = df_telco.partner == 'Yes'
df_telco.dependents = df_telco.dependents == 'Yes'
df_telco.churn = df_telco.churn == 'Yes'
df_telco.is_senior_citizen = df_telco.is_senior_citizen == 1

df_telco.head()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn,Unnamed: 12,Unnamed: 13
0,0002-ORFBO,Female,False,True,True,1,1,1,Mailed check,65.6,593.30,False,NaN,NaN
1,0003-MKNFE,Male,False,False,False,2,1,0,Mailed check,59.9,542.40,False,NaN,NaN
2,0004-TLHLJ,Male,False,False,False,1,2,0,Electronic check,73.9,280.85,True,NaN,NaN
3,0011-IGKFF,Male,True,True,False,1,2,0,Electronic check,98.0,1237.85,True,NaN,NaN
4,0013-EXCHZ,Female,True,True,False,1,2,0,Mailed check,83.9,267.40,True,NaN,NaN

In [6]:
#2
df_telco_sample = df_telco.head(100)

In [7]:
#2
df_telco.shape[0]

7049

In [8]:
#2
df_telco.columns[0:5].to_list()

['customer_id', 'gender', 'is_senior_citizen', 'partner', 'dependents']

In [10]:
#2
df_telco.select_dtypes(include='object').columns.to_list()

['customer_id',
 'gender',
 'phone_service',
 'internet_service',
 'contract_type',
 'payment_type']

In [11]:
#2
stats = df_telco.describe().T
stats

,count,mean,std,min,25%,50%,75%,max
monthly_charges,7049.0,64.747014,30.099460,18.25,35.4500,70.35,89.850,118.75
total_charges,7038.0,2283.043883,2266.521984,18.80,401.5875,1397.10,3793.775,8684.80
Unnamed: 12,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Unnamed: 13,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [12]:
#2
stats['range'] = stats['max'] - stats['min']
stats

,count,mean,std,min,25%,50%,75%,max,range
monthly_charges,7049.0,64.747014,30.099460,18.25,35.4500,70.35,89.850,118.75,100.5
total_charges,7038.0,2283.043883,2266.521984,18.80,401.5875,1397.10,3793.775,8684.80,8666.0
Unnamed: 12,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Unnamed: 13,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [15]:
#2
# alternative method to get the range
num = df_telco.select_dtypes(include = ['float64', 'int64'])
num.max() - num.min()

monthly_charges     100.5
total_charges      8666.0
Unnamed: 12           NaN
Unnamed: 13           NaN
dtype: float64

#3
Read the data from this google sheet into a dataframe, df_google

print the first 3 rows
print the number of rows and columns
print the column names
print the data type of each column
print the summary statistics for each of the numeric variables
print the unique values for each of your categorical variables

In [17]:
#3
# assign a variable name to the url
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'

In [18]:
#3
# modify the google sheet share url to become a csv export url
csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

# convert csv to dataframe
df_google = pd.read_csv(csv_export_url)

df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [19]:
#3
df_google.shape

(891, 12)

In [20]:
#3
df_google.columns.to_list()

['PassengerId',
 'Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

In [21]:
#3
df_google.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [23]:
#3
df_google.describe().T

,count,mean,std,min,25%,50%,75%,max
PassengerId,891.0,446.000000,257.353842,1.00,223.5000,446.0000,668.5,891.0000
Survived,891.0,0.383838,0.486592,0.00,0.0000,0.0000,1.0,1.0000
Pclass,891.0,2.308642,0.836071,1.00,2.0000,3.0000,3.0,3.0000
Age,714.0,29.699118,14.526497,0.42,20.1250,28.0000,38.0,80.0000
SibSp,891.0,0.523008,1.102743,0.00,0.0000,0.0000,1.0,8.0000
Parch,891.0,0.381594,0.806057,0.00,0.0000,0.0000,0.0,6.0000
Fare,891.0,32.204208,49.693429,0.00,7.9104,14.4542,31.0,512.3292

In [25]:
#3
for column in df_google.select_dtypes(include='object').columns:
    print(f'values in {column} column:')
    print(df_google[column].value_counts())
    print('..........')

values in Name column:
Hansen, Mr. Henrik Juul                       1
McCoy, Miss. Agnes                            1
Andersson, Master. Sigvard Harald Elias       1
Barbara, Mrs. (Catherine David)               1
Pain, Dr. Alfred                              1
                                             ..
Strom, Mrs. Wilhelm (Elna Matilda Persson)    1
Hickman, Mr. Lewis                            1
Stewart, Mr. Albert A                         1
Coutts, Master. William Loch "William"        1
Van Impe, Miss. Catharina                     1
Name: Name, Length: 891, dtype: int64
..........
values in Sex column:
male      577
female    314
Name: Sex, dtype: int64
..........
values in Ticket column:
1601          7
347082        7
CA. 2343      7
CA 2144       6
3101295       6
             ..
345778        1
PC 17475      1
2663          1
17466         1
A.5. 11206    1
Name: Ticket, Length: 681, dtype: int64
..........
values in Cabin column:
C23 C25 C27        4
G6                 4
B96 B98            4
C22 C26            3
D                  3
F33                3
F2                 3
E101               3
C83                2
C123               2
C78                2
E24                2
E33                2
F4                 2
C2                 2
D35                2
D36                2
C125               2
E121               2
B28                2
C92                2
B77                2
E25                2
B51 B53 B55        2
F G73              2
E67                2
D26                2
D20                2
B5                 2
C68                2
B35                2
C93                2
C126               2
B57 B59 B63 B66    2
D33                2
C124               2
E44                2
C65                2
E8                 2
B49                2
B58 B60            2
B18                2
B22                2
D17                2
C52                2
B20                2
D45                1
C118               1
B69                1
D9                 1
B39                1
C70                1
E34                1
B79                1
D28                1
A7                 1
A19                1
C104               1
B42                1
A20                1
D10 D12            1
C111               1
C86                1
A26                1
C103               1
B102               1
C87                1
A16                1
E17                1
C90                1
A10                1
A23                1
B37                1
B82 B84            1
A34                1
B3                 1
B30                1
B19                1
D50                1
D37                1
C47                1
C101               1
B71                1
F38                1
D15                1
D21                1
A32                1
D11                1
E49                1
F G63              1
C50                1
C148               1
C99                1
C46                1
A24                1
C30                1
D49                1
C7                 1
T                  1
C91                1
D6                 1
B94                1
B86                1
B73                1
C49                1
E50                1
B78                1
A6                 1
A14                1
B101               1
C32                1
C85                1
C62 C64            1
E10                1
D30                1
D46                1
A36                1
C110               1
C45                1
E68                1
E58                1
A5                 1
B4                 1
D7                 1
C106               1
D56                1
C128               1
A31                1
B38                1
E40                1
E36                1
D47                1
F E69              1
D48                1
E77                1
E12                1
B41                1
C54                1
E46                1
B80                1
D19                1
B50                1
C95                1
E31                1
E38                1
E63                1
C82                1
Name: Cabin, dtype: int64
..........
values in Embarked column:
S    644
C    168
Q     77
Name: Embarked, dtype: int64
..........